[
  {
    "Id": 1,
    "targetId": 1,
    "targetType": "university",
    "authorType": "verified",
    "authorId": "user123",
    "rating": 9,
    "content": "Cairo University has been an incredible experience for me. The faculty is world-class, the facilities are excellent, and the academic environment is truly stimulating. The campus life is vibrant and there are numerous opportunities for extracurricular activities. I would highly recommend this university to anyone looking for quality higher education in Egypt.",
    "createdAt": "2024-01-15T10:30:00Z",
    "status": "approved",
    "helpfulCount": 45
  },
  {
    "Id": 2,
    "targetId": 1,
    "targetType": "university",
    "authorType": "registered",
    "authorId": "user456",
    "rating": 8,
    "content": "Great university with rich history and tradition. The professors are knowledgeable and the library resources are extensive. However, some administrative processes could be improved. Overall, it's a solid choice for higher education.",
    "createdAt": "2024-01-10T14:20:00Z",
    "status": "approved",
    "helpfulCount": 32
  },
  {
    "Id": 3,
    "targetId": 1,
    "targetType": "faculty",
    "authorType": "verified",
    "authorId": "user789",
    "rating": 10,
    "content": "The Faculty of Medicine at Cairo University is absolutely outstanding. The clinical training is comprehensive, the professors are experts in their fields, and the research opportunities are abundant. The curriculum is rigorous but prepares you well for medical practice. Highly recommended for aspiring doctors.",
    "createdAt": "2024-01-08T09:15:00Z",
    "status": "approved",
    "helpfulCount": 67
  },
  {
    "Id": 4,
    "targetId": 2,
    "targetType": "faculty",
    "authorType": "anonymous",
    "authorId": null,
    "rating": 8,
    "content": "Engineering faculty at Cairo University provides excellent technical education. The labs are well-equipped and the projects are challenging. The only downside is that some courses could be more updated to reflect current industry trends.",
    "createdAt": "2024-01-05T16:45:00Z",
    "status": "approved",
    "helpfulCount": 23
  },
  {
    "Id": 5,
    "targetId": 2,
    "targetType": "university",
    "authorType": "verified",
    "authorId": "user101",
    "rating": 8,
    "content": "Alexandria University offers a great academic environment with beautiful campus by the Mediterranean. The faculty is competent and the student community is diverse. The coastal location adds to the overall experience of studying here.",
    "createdAt": "2024-01-03T11:30:00Z",
    "status": "approved",
    "helpfulCount": 38
  },
  {
    "Id": 6,
    "targetId": 4,
    "targetType": "university",
    "authorType": "verified",
    "authorId": "user202",
    "rating": 9,
    "content": "AUC provides world-class education with American standards. The campus is modern, the facilities are top-notch, and the professors are highly qualified. The liberal arts education approach is excellent for developing critical thinking skills. Worth every penny of the tuition fees.",
    "createdAt": "2024-01-01T13:20:00Z",
    "status": "approved",
    "helpfulCount": 56
  },
  {
    "Id": 7,
    "targetId": 6,
    "targetType": "faculty",
    "authorType": "registered",
    "authorId": "user303",
    "rating": 9,
    "content": "The School of Business at AUC is exceptional. The curriculum is internationally recognized, the case study method is effectively used, and the networking opportunities are invaluable. The career services are also very helpful in securing internships and jobs.",
    "createdAt": "2023-12-28T15:10:00Z",
    "status": "approved",
    "helpfulCount": 41
  },
  {
    "Id": 8,
    "targetId": 3,
    "targetType": "university",
    "authorType": "anonymous",
    "authorId": null,
    "rating": 7,
    "content": "Ain Shams University is a decent choice for higher education. The academic quality is good and the fees are reasonable. However, the campus infrastructure could use some updates. The location in Cairo is convenient for students.",
    "createdAt": "2023-12-25T10:00:00Z",
    "status": "approved",
    "helpfulCount": 19
  },
  {
    "Id": 9,
    "targetId": 8,
    "targetType": "faculty",
    "authorType": "verified",
    "authorId": "user404",
    "rating": 8,
    "content": "The Faculty of Medicine at Ain Shams is well-regarded in Egypt. The clinical exposure is good and the professors are experienced. The hospital facilities provide excellent practical training opportunities for medical students.",
    "createdAt": "2023-12-22T14:30:00Z",
    "status": "approved",
    "helpfulCount": 29
  },
  {
    "Id": 10,
    "targetId": 5,
    "targetType": "university",
    "authorType": "registered",
    "authorId": "user505",
    "rating": 8,
    "content": "Mansoura University has a strong reputation especially in the medical field. The campus is well-maintained and the student life is active. The university has good research facilities and encourages student participation in research projects.",
    "createdAt": "2023-12-20T09:45:00Z",
    "status": "approved",
    "helpfulCount": 33
  },
  {
    "Id": 11,
    "targetId": 9,
    "targetType": "faculty",
    "authorType": "verified",
    "authorId": "user606",
    "rating": 9,
    "content": "Outstanding medical education at Mansoura University. The faculty is dedicated, the curriculum is comprehensive, and the research opportunities are excellent. The university hospital provides great clinical training experience.",
    "createdAt": "2023-12-18T12:15:00Z",
    "status": "approved",
    "helpfulCount": 52
  },
  {
    "Id": 12,
    "targetId": 6,
    "targetType": "university",
    "authorType": "anonymous",
    "authorId": null,
    "rating": 7,
    "content": "Assiut University serves the Upper Egypt region well. The academic programs are solid and the fees are affordable. The campus is spacious and the student community is welcoming. Some facilities could be modernized.",
    "createdAt": "2023-12-15T16:20:00Z",
    "status": "approved",
    "helpfulCount": 15
  },
  {
    "Id": 13,
    "targetId": 7,
    "targetType": "faculty",
    "authorType": "verified",
    "authorId": "user707",
    "rating": 9,
    "content": "The School of Sciences and Engineering at AUC is fantastic. The professors are world-class, the research opportunities are abundant, and the facilities are state-of-the-art. The small class sizes allow for personalized attention and better learning outcomes.",
    "createdAt": "2023-12-12T11:00:00Z",
    "status": "approved",
    "helpfulCount": 44
  },
  {
    "Id": 14,
    "targetId": 10,
    "targetType": "faculty",
    "authorType": "registered",
    "authorId": "user808",
    "rating": 8,
    "content": "The Faculty of Engineering at Mansoura University provides solid engineering education. The practical training is emphasized and the industry connections are helpful for job placement. The professors are knowledgeable and supportive.",
    "createdAt": "2023-12-10T13:40:00Z",
    "status": "approved",
    "helpfulCount": 26
  },
  {
    "Id": 15,
    "targetId": 4,
    "targetType": "faculty",
    "authorType": "verified",
    "authorId": "user909",
    "rating": 9,
    "content": "Excellent medical education at Alexandria University. The faculty is experienced and the clinical training is comprehensive. The university hospital provides diverse cases for learning. The research opportunities are also quite good.",
    "createdAt": "2023-12-08T15:55:00Z",
    "status": "approved",
    "helpfulCount": 37
  }
]