[
  {
    "Id": 1,
    "targetId": 1,
    "targetType": "university",
    "authorType": "verified",
    "authorId": "user123",
    "rating": 9,
    "content": "Cairo University has been an incredible experience for me. The faculty is world-class, the facilities are excellent, and the academic environment is truly stimulating. The campus life is vibrant and there are numerous opportunities for extracurricular activities. I would highly recommend this university to anyone looking for quality higher education in Egypt.",
    "createdAt": "2024-01-15T10:30:00Z",
    "status": "approved",
    "helpfulCount": 45
  },
  {
    "Id": 2,
    "targetId": 1,
    "targetType": "university",
    "authorType": "registered",
    "authorId": "user456",
    "rating": 8,
    "content": "Great university with rich history and tradition. The professors are knowledgeable and the library resources are extensive. However, some administrative processes could be improved. Overall, it's a solid choice for higher education.",
    "createdAt": "2024-01-10T14:20:00Z",
    "status": "approved",
    "helpfulCount": 32
  },
  {
    "Id": 3,
    "targetId": 1,
    "targetType": "faculty",
    "authorType": "verified",
    "authorId": "user789",
    "rating": 10,
    "content": "The Faculty of Medicine at Cairo University is absolutely outstanding. The clinical training is comprehensive, the professors are experts in their fields, and the research opportunities are abundant. The curriculum is rigorous but prepares you well for medical practice. Highly recommended for aspiring doctors.",
    "createdAt": "2024-01-08T09:15:00Z",
    "status": "approved",
    "helpfulCount": 67
  },
  {
    "Id": 4,
    "targetId": 2,
    "targetType": "faculty",
    "authorType": "anonymous",
    "authorId": null,
    "rating": 8,
    "content": "Engineering faculty at Cairo University provides excellent technical education. The labs are well-equipped and the projects are challenging. The only downside is that some courses could be more updated to reflect current industry trends.",
    "createdAt": "2024-01-05T16:45:00Z",
    "status": "approved",
    "helpfulCount": 23
  },
  {
    "Id": 5,
    "targetId": 2,
    "targetType": "university",
    "authorType": "verified",
    "authorId": "user101",
    "rating": 8,
    "content": "Alexandria University offers a great academic environment with beautiful campus by the Mediterranean. The faculty is competent and the student community is diverse. The coastal location adds to the overall experience of studying here.",
    "createdAt": "2024-01-03T11:30:00Z",
    "status": "approved",
    "helpfulCount": 38
  },
  {
    "Id": 6,
    "targetId": 4,
    "targetType": "university",
    "authorType": "verified",
    "authorId": "user202",
    "rating": 9,
    "content": "AUC provides world-class education with American standards. The campus is modern, the facilities are top-notch, and the professors are highly qualified. The liberal arts education approach is excellent for developing critical thinking skills. Worth every penny of the tuition fees.",
    "createdAt": "2024-01-01T13:20:00Z",
    "status": "approved",
    "helpfulCount": 56
  },
  {
    "Id": 7,
    "targetId": 6,
    "targetType": "faculty",
    "authorType": "registered",
    "authorId": "user303",
    "rating": 9,
    "content": "The School of Business at AUC is exceptional. The curriculum is internationally recognized, the case study method is effectively used, and the networking opportunities are invaluable. The career services are also very helpful in securing internships and jobs.",
    "createdAt": "2023-12-28T15:10:00Z",
    "status": "approved",
    "helpfulCount": 41
  },
  {
    "Id": 8,
    "targetId": 3,
    "targetType": "university",
    "authorType": "anonymous",
    "authorId": null,
    "rating": 7,
    "content": "Ain Shams University is a decent choice for higher education. The academic quality is good and the fees are reasonable. However, the campus infrastructure could use some updates. The location in Cairo is convenient for students.",
    "createdAt": "2023-12-25T10:00:00Z",
    "status": "approved",
    "helpfulCount": 19
  },
  {
    "Id": 9,
    "targetId": 8,
    "targetType": "faculty",
    "authorType": "verified",
    "authorId": "user404",
    "rating": 8,
    "content": "The Faculty of Medicine at Ain Shams is well-regarded in Egypt. The clinical exposure is good and the professors are experienced. The hospital facilities provide excellent practical training opportunities for medical students.",
    "createdAt": "2023-12-22T14:30:00Z",
    "status": "approved",
    "helpfulCount": 29
  },
  {
    "Id": 10,
    "targetId": 5,
    "targetType": "university",
    "authorType": "registered",
    "authorId": "user505",
    "rating": 8,
    "content": "Mansoura University has a strong reputation especially in the medical field. The campus is well-maintained and the student life is active. The university has good research facilities and encourages student participation in research projects.",
    "createdAt": "2023-12-20T09:45:00Z",
    "status": "approved",
    "helpfulCount": 33
  },
  {
    "Id": 11,
    "targetId": 9,
    "targetType": "faculty",
    "authorType": "verified",
    "authorId": "user606",
    "rating": 9,
    "content": "Outstanding medical education at Mansoura University. The faculty is dedicated, the curriculum is comprehensive, and the research opportunities are excellent. The university hospital provides great clinical training experience.",
    "createdAt": "2023-12-18T12:15:00Z",
    "status": "approved",
    "helpfulCount": 52
  },
  {
    "Id": 12,
    "targetId": 6,
    "targetType": "university",
    "authorType": "anonymous",
    "authorId": null,
    "rating": 7,
    "content": "Assiut University serves the Upper Egypt region well. The academic programs are solid and the fees are affordable. The campus is spacious and the student community is welcoming. Some facilities could be modernized.",
    "createdAt": "2023-12-15T16:20:00Z",
    "status": "approved",
    "helpfulCount": 15
  },
  {
    "Id": 13,
    "targetId": 7,
    "targetType": "faculty",
    "authorType": "verified",
    "authorId": "user707",
    "rating": 9,
    "content": "The School of Sciences and Engineering at AUC is fantastic. The professors are world-class, the research opportunities are abundant, and the facilities are state-of-the-art. The small class sizes allow for personalized attention and better learning outcomes.",
    "createdAt": "2023-12-12T11:00:00Z",
    "status": "approved",
    "helpfulCount": 44
  },
  {
    "Id": 14,
    "targetId": 10,
    "targetType": "faculty",
    "authorType": "registered",
    "authorId": "user808",
    "rating": 8,
    "content": "The Faculty of Engineering at Mansoura University provides solid engineering education. The practical training is emphasized and the industry connections are helpful for job placement. The professors are knowledgeable and supportive.",
    "createdAt": "2023-12-10T13:40:00Z",
    "status": "approved",
    "helpfulCount": 26
  },
  {
    "Id": 15,
    "targetId": 4,
    "targetType": "faculty",
    "authorType": "verified",
    "authorId": "user909",
    "rating": 9,
    "content": "Excellent medical education at Alexandria University. The faculty is experienced and the clinical training is comprehensive. The university hospital provides diverse cases for learning. The research opportunities are also quite good.",
    "createdAt": "2023-12-08T15:55:00Z",
    "status": "approved",
    "helpfulCount": 37
},
  {
    "Id": 16,
    "targetId": 5,
    "targetType": "faculty",
    "authorType": "verified",
    "authorId": "user1010",
    "rating": 8,
    "content": "The Faculty of Engineering at Alexandria University provides excellent engineering education with strong emphasis on practical applications. The professors are experienced and the labs are well-equipped. The coastal location is an added advantage.",
    "createdAt": "2023-12-05T10:30:00Z",
    "status": "approved",
    "helpfulCount": 31
  },
  {
    "Id": 17,
    "targetId": 7,
    "targetType": "university",
    "authorType": "verified",
    "authorId": "user1111",
    "rating": 9,
    "content": "German University in Cairo offers world-class education with German standards. The international environment, modern facilities, and strong industry connections make it an excellent choice for students seeking quality education.",
    "createdAt": "2023-12-03T14:20:00Z",
    "status": "approved",
    "helpfulCount": 48
  },
  {
    "Id": 18,
    "targetId": 11,
    "targetType": "faculty",
    "authorType": "registered",
    "authorId": "user1212",
    "rating": 9,
    "content": "The Faculty of Engineering at GUC is outstanding. The German education system, small class sizes, and excellent professors create an ideal learning environment. The practical training and industry projects are invaluable.",
    "createdAt": "2023-12-01T09:15:00Z",
    "status": "approved",
    "helpfulCount": 42
  },
  {
    "Id": 19,
    "targetId": 12,
    "targetType": "faculty",
    "authorType": "verified",
    "authorId": "user1313",
    "rating": 8,
    "content": "The Faculty of Management Technology at GUC combines business and technology perfectly. The curriculum is up-to-date, the professors are industry experts, and the career opportunities are excellent. Highly recommended for business students.",
    "createdAt": "2023-11-28T16:45:00Z",
    "status": "approved",
    "helpfulCount": 35
  },
  {
    "Id": 20,
    "targetId": 8,
    "targetType": "university",
    "authorType": "anonymous",
    "authorId": null,
    "rating": 8,
    "content": "Suez Canal University provides good education in the eastern region. The campus is well-maintained and the academic programs are solid. The location in Ismailia is peaceful and conducive to learning.",
    "createdAt": "2023-11-25T11:30:00Z",
    "status": "approved",
    "helpfulCount": 22
  },
  {
    "Id": 21,
    "targetId": 13,
    "targetType": "faculty",
    "authorType": "verified",
    "authorId": "user1414",
    "rating": 8,
    "content": "The Faculty of Medicine at Suez Canal University offers quality medical education. The clinical training is comprehensive and the professors are dedicated. The university hospital provides excellent practical experience.",
    "createdAt": "2023-11-23T13:20:00Z",
    "status": "approved",
    "helpfulCount": 39
  },
  {
    "Id": 22,
    "targetId": 14,
    "targetType": "faculty",
    "authorType": "registered",
    "authorId": "user1515",
    "rating": 8,
    "content": "Excellent dental education at Suez Canal University. The faculty is modern, the equipment is up-to-date, and the clinical training is thorough. The professors are skilled and supportive throughout the program.",
    "createdAt": "2023-11-20T15:10:00Z",
    "status": "approved",
    "helpfulCount": 28
  },
  {
    "Id": 23,
    "targetId": 9,
    "targetType": "university",
    "authorType": "verified",
    "authorId": "user1616",
    "rating": 8,
    "content": "Helwan University is known for its practical approach to education. The engineering and applied arts programs are particularly strong. The campus facilities are good and the student community is active.",
    "createdAt": "2023-11-18T12:00:00Z",
    "status": "approved",
    "helpfulCount": 33
  },
  {
    "Id": 24,
    "targetId": 15,
    "targetType": "faculty",
    "authorType": "verified",
    "authorId": "user1717",
    "rating": 9,
    "content": "The Faculty of Applied Arts at Helwan University is exceptional. The creative environment, experienced professors, and excellent facilities make it the best choice for art students in Egypt. The industry connections are valuable.",
    "createdAt": "2023-11-15T14:30:00Z",
    "status": "approved",
    "helpfulCount": 51
  },
  {
    "Id": 25,
    "targetId": 16,
    "targetType": "faculty",
    "authorType": "registered",
    "authorId": "user1818",
    "rating": 8,
    "content": "Good engineering education at Helwan University. The practical training is emphasized and the professors have industry experience. The automotive engineering program is particularly strong and well-regarded.",
    "createdAt": "2023-11-12T10:45:00Z",
    "status": "approved",
    "helpfulCount": 26
  },
  {
    "Id": 26,
    "targetId": 10,
    "targetType": "university",
    "authorType": "anonymous",
    "authorId": null,
    "rating": 7,
    "content": "Zagazig University serves the eastern delta region well. The academic programs are comprehensive and the fees are reasonable. The agricultural and veterinary programs are particularly strong.",
    "createdAt": "2023-11-10T09:20:00Z",
    "status": "approved",
    "helpfulCount": 18
  },
  {
    "Id": 27,
    "targetId": 17,
    "targetType": "faculty",
    "authorType": "verified",
    "authorId": "user1919",
    "rating": 8,
    "content": "The Faculty of Medicine at Zagazig University provides solid medical education. The clinical training is good and the professors are experienced. The university hospital offers diverse cases for learning.",
    "createdAt": "2023-11-08T16:15:00Z",
    "status": "approved",
    "helpfulCount": 34
  },
  {
    "Id": 28,
    "targetId": 18,
    "targetType": "faculty",
    "authorType": "verified",
    "authorId": "user2020",
    "rating": 8,
    "content": "Outstanding veterinary education at Zagazig University. The faculty is well-equipped with modern facilities and the professors are experts in their fields. The practical training with animals is comprehensive.",
    "createdAt": "2023-11-05T11:40:00Z",
    "status": "approved",
    "helpfulCount": 41
  },
  {
    "Id": 29,
    "targetId": 19,
    "targetType": "faculty",
    "authorType": "registered",
    "authorId": "user2121",
    "rating": 8,
    "content": "The Faculty of Medicine at Assiut University is highly regarded in Upper Egypt. The academic standards are high and the clinical training is excellent. The professors are dedicated and supportive.",
    "createdAt": "2023-11-03T13:25:00Z",
    "status": "approved",
    "helpfulCount": 29
  },
  {
    "Id": 30,
    "targetId": 20,
    "targetType": "faculty",
    "authorType": "verified",
    "authorId": "user2222",
    "rating": 8,
    "content": "Excellent agricultural education at Zagazig University. The faculty is located in the heart of the agricultural region, providing real-world learning opportunities. The professors are knowledgeable and the research opportunities are good.",
    "createdAt": "2023-11-01T15:50:00Z",
    "status": "approved",
    "helpfulCount": 23
  },
  {
    "Id": 31,
    "targetId": 1,
    "targetType": "university",
    "authorType": "registered",
    "authorId": "user2323",
    "rating": 9,
    "content": "Cairo University continues to be Egypt's premier institution. The diversity of programs, quality of education, and historical significance make it a top choice. The campus life is vibrant and the opportunities are endless.",
    "createdAt": "2023-10-30T12:10:00Z",
    "status": "approved",
    "helpfulCount": 56
  },
  {
    "Id": 32,
    "targetId": 3,
    "targetType": "faculty",
    "authorType": "verified",
    "authorId": "user2424",
    "rating": 8,
    "content": "The Faculty of Economics and Political Science at Cairo University provides excellent education in social sciences. The professors are renowned experts and the research opportunities are abundant. Great preparation for various careers.",
    "createdAt": "2023-10-28T14:35:00Z",
    "status": "approved",
    "helpfulCount": 38
  },
  {
    "Id": 33,
    "targetId": 4,
    "targetType": "university",
    "authorType": "verified",
    "authorId": "user2525",
    "rating": 9,
    "content": "AUC maintains its reputation as one of the best universities in the region. The liberal arts education, international faculty, and modern facilities create an exceptional learning environment. Worth the investment.",
    "createdAt": "2023-10-25T11:20:00Z",
    "status": "approved",
    "helpfulCount": 62
  },
  {
    "Id": 34,
    "targetId": 2,
    "targetType": "university",
    "authorType": "anonymous",
    "authorId": null,
    "rating": 8,
    "content": "Alexandria University offers great education with the advantage of being in a beautiful coastal city. The academic programs are solid and the campus atmosphere is pleasant. Good value for money.",
    "createdAt": "2023-10-23T09:45:00Z",
    "status": "approved",
    "helpfulCount": 27
  },
  {
    "Id": 35,
    "targetId": 5,
    "targetType": "university",
    "authorType": "registered",
    "authorId": "user2626",
    "rating": 8,
    "content": "Mansoura University has a strong reputation, especially in medical education. The research facilities are good and the professors are committed to student success. The campus is well-maintained and modern.",
    "createdAt": "2023-10-20T16:30:00Z",
    "status": "approved",
    "helpfulCount": 35
  },
  {
    "Id": 36,
    "targetId": 6,
    "targetType": "university",
    "authorType": "verified",
    "authorId": "user2727",
    "rating": 7,
    "content": "Assiut University serves Upper Egypt well with its comprehensive programs. The medical and engineering faculties are particularly strong. The campus is spacious and the fees are affordable for quality education.",
    "createdAt": "2023-10-18T13:15:00Z",
    "status": "approved",
    "helpfulCount": 21
  },
  {
    "Id": 37,
    "targetId": 7,
    "targetType": "university",
    "authorType": "verified",
    "authorId": "user2828",
    "rating": 9,
    "content": "GUC provides an excellent German education experience in Egypt. The small class sizes, international environment, and strong industry connections make it stand out. The faculty is highly qualified and supportive.",
    "createdAt": "2023-10-15T10:55:00Z",
    "status": "approved",
    "helpfulCount": 49
  },
  {
    "Id": 38,
    "targetId": 8,
    "targetType": "university",
    "authorType": "registered",
    "authorId": "user2929",
    "rating": 8,
    "content": "Suez Canal University offers good education in a strategic location. The medical and engineering programs are well-regarded. The campus environment is conducive to learning and the student support is adequate.",
    "createdAt": "2023-10-12T12:40:00Z",
    "status": "approved",
    "helpfulCount": 24
  },
  {
    "Id": 39,
    "targetId": 9,
    "targetType": "university",
    "authorType": "verified",
    "authorId": "user3030",
    "rating": 8,
    "content": "Helwan University excels in practical education. The applied arts and engineering programs are outstanding. The hands-on approach and industry partnerships provide valuable real-world experience.",
    "createdAt": "2023-10-10T15:25:00Z",
    "status": "approved",
    "helpfulCount": 37
  },
  {
    "Id": 40,
    "targetId": 10,
    "targetType": "university",
    "authorType": "anonymous",
    "authorId": null,
    "rating": 7,
    "content": "Zagazig University is a solid choice for students in the eastern delta region. The agricultural and veterinary programs are particularly strong, and the fees are reasonable. The campus is well-maintained.",
    "createdAt": "2023-10-08T11:05:00Z",
    "status": "approved",
    "helpfulCount": 19
  }
]